notes/meeting_2021oct10.org
* meeting notes October 10, 2021                                      a
** the usual links:
*** meeting notes
**** https://github.com/doomvox/raku-study/blob/main/notes/meeting_2021oct10.md
*** code examples:
**** https://github.com/doomvox/raku-study/tree/main/bin/2021oct10
** stuff it all in to the great stuffiness
*** data-handling in raku 
**** talked about three rough approaches
***** perl-style: arrays of hashes, hashes as records
***** raku: data container objects more practical
***** rlang-style: columns of data, aggregate methods appropriate for type

**** note: i'm agnostic on strong typing
***** some type checking good, large amounts may just be redundant
***** testing can stubstitute for strong-types, but not vice-versa

**** bruce gray demoed some techniques 
***** micro-objects as data records
***** custom new method

*** bioinformatics on rosettacode 
**** there's a half dozen entries, here's a simple one:
***** http://rosettacode.org/wiki/Bioinformatics/base_count

*** bugnuts
**** a buglet or I'm crazy (smart money is on...)  (yup, crazy)
***** https://github.com/doomvox/raku-study/tree/main/bin/2021sep26/anon_var_vs_topic.raku


*** William Michels stackoverflow one-liner adventures
**** the flip-flop operator
 https://unix.stackexchange.com/a/672602/227738
**** 
https://stackoverflow.com/a/69489459/7270649

**** raku and the absence of globbing in windows command.exe 
https://stackoverflow.com/questions/69384754/how-do-i-use-raku-e-and-n-with-multiple-file-glob/69400187
https://superuser.com/questions/460598/is-there-any-way-to-get-the-windows-cmd-shell-to-expand-wildcard-paths
https://stackoverflow.com/questions/23908299/ruby-windows-command-line-globbing
https://stackoverflow.com/questions/3954750/parsing-command-line-arguments-as-wildcards
https://www.ruby-forum.com/t/ruby-wildcard-command-line-argument-auto-expansion/106378/3


*** general notes
**** Herbert Simon, "Sciences of the Artificial", an Alan pick
***** https://mitpress.mit.edu/books/sciences-artificial 

** announcements
*** the ephemeral miniconf: nov 18 2021
**** https://dev.to/thibaultduponchelle/the-ephemeral-miniconf-292j
** next meeting
*** next meeting: Oct 24, 2021


