notes/meeting_2021oct10.md
- [meeting notes October 10, 2021                                      a](#org1a925f7)
  - [the usual links:](#org94e6bf2)
    - [meeting notes](#orgae01cea)
    - [code examples:](#orgdc0e499)
  - [stuff it all in to the great stuffiness](#org1c7a2e3)
    - [data-handling in raku](#org9ff71c5)
    - [bioinformatics on rosettacode](#org50729b1)
    - [bugnuts](#org6d91432)
    - [William Michels stackoverflow one-liner adventures](#org2702cdd)
    - [general notes](#org1c26d17)
  - [announcements](#orgee78dc9)
    - [the ephemeral miniconf: nov 18 2021](#org667e06a)
  - [next meeting](#org7a4c567)
    - [next meeting: Oct 24, 2021](#org6a5ed67)


<a id="org1a925f7"></a>

# meeting notes October 10, 2021                                      a


<a id="org94e6bf2"></a>

## the usual links:


<a id="orgae01cea"></a>

### meeting notes

1.  <https://github.com/doomvox/raku-study/blob/main/notes/meeting_2021oct10.md>


<a id="orgdc0e499"></a>

### code examples:

1.  <https://github.com/doomvox/raku-study/tree/main/bin/2021oct10>


<a id="org1c7a2e3"></a>

## stuff it all in to the great stuffiness


<a id="org9ff71c5"></a>

### data-handling in raku

1.  talked about three rough approaches

    1.  perl-style: arrays of hashes, hashes as records
    
    2.  raku: data container objects more practical
    
    3.  rlang-style: columns of data, aggregate methods appropriate for type

2.  note: i'm agnostic on strong typing

    1.  some type checking good, large amounts may just be redundant
    
    2.  testing can stubstitute for strong-types, but not vice-versa

3.  bruce gray demoed some techniques

    1.  micro-objects as data records
    
    2.  custom new method


<a id="org50729b1"></a>

### bioinformatics on rosettacode

1.  there's a half dozen entries, here's a simple one:

    1.  <http://rosettacode.org/wiki/Bioinformatics/base_count>


<a id="org6d91432"></a>

### bugnuts

1.  a buglet or I'm crazy (smart money is on&#x2026;)  (yup, crazy)

    1.  <https://github.com/doomvox/raku-study/tree/main/bin/2021sep26/anon_var_vs_topic.raku>


<a id="org2702cdd"></a>

### William Michels stackoverflow one-liner adventures

1.  the flip-flop operator

    <https://unix.stackexchange.com/a/672602/227738>

2.  

    <https://stackoverflow.com/a/69489459/7270649>

3.  raku and the absence of globbing in windows command.exe

    <https://stackoverflow.com/questions/69384754/how-do-i-use-raku-e-and-n-with-multiple-file-glob/69400187> <https://superuser.com/questions/460598/is-there-any-way-to-get-the-windows-cmd-shell-to-expand-wildcard-paths> <https://stackoverflow.com/questions/23908299/ruby-windows-command-line-globbing> <https://stackoverflow.com/questions/3954750/parsing-command-line-arguments-as-wildcards> <https://www.ruby-forum.com/t/ruby-wildcard-command-line-argument-auto-expansion/106378/3>


<a id="org1c26d17"></a>

### general notes

1.  Herbert Simon, "Sciences of the Artificial", an Alan pick

    1.  <https://mitpress.mit.edu/books/sciences-artificial>


<a id="orgee78dc9"></a>

## announcements


<a id="org667e06a"></a>

### the ephemeral miniconf: nov 18 2021

1.  <https://dev.to/thibaultduponchelle/the-ephemeral-miniconf-292j>


<a id="org7a4c567"></a>

## next meeting


<a id="org6a5ed67"></a>

### next meeting: Oct 24, 2021
